package org.example;

import java.time.LocalDate;

public class LunarPhasePredictor {


    public static String getLunarPhasePrediction() {
        String lunarPhase = determineLunarPhase();
        String prediction = getPredictionForPhase(lunarPhase);
        return "Фаза Луни: " + lunarPhase + "\nПередбачення: " + prediction;
    }

    private static String determineLunarPhase() {
        LocalDate currentDate = LocalDate.now();
        int year = currentDate.getYear();
        int month = currentDate.getMonthValue();
        int day = currentDate.getDayOfMonth();

        int age = calculateMoonAge(year, month, day);
        String lunarPhase;
        if (age < 1 || age > 29) {
            lunarPhase = "Невідома фаза Місяця";
        } else if (age < 7) {
            lunarPhase = "Молодий Місяць";
        } else if (age < 15) {
            lunarPhase = "Наростаюча тонка молодикова сичуга";
        } else if (age < 22) {
            lunarPhase = "Перша чверть";
        } else if (age < 29) {
            lunarPhase = "Наростаюча повнолуние";
        } else if (age == 29) {
            lunarPhase = "Повнолуние";
        } else if (age == 0) {
            lunarPhase = "Спадна повнолуние";
        } else {
            lunarPhase = "Остання чверть";
        }

        return lunarPhase;
    }

    private static int calculateMoonAge(int year, int month, int day) {
        double agesPerDay = 29.53058867; // Середня тривалість фази Місяця
        double phase = 0.5; // Початкова фаза Місяця
        double dateFraction = (year - 1900) * 12 + (month - 1) + (day - 1) / 30.0;

        double age = (dateFraction - phase) % agesPerDay;
        if (age < 0) {
            age += agesPerDay;
        }

        return (int) Math.floor(age);
    }

    private static String getPredictionForPhase(String lunarPhase) {
        String prediction;
        switch (lunarPhase) {
            case "Молодий Місяць":
                prediction = getRandomPredictionForNewMoon();
                break;
            case "Наростаюча тонка молодикова сичуга":
                prediction =  getRandomPredictionForMolodoySichyga();
                break;
            case "Перша чверть":
                prediction =   getRandomPredictionFirstPart();
                break;
            case "Наростаюча повнолуние":
                prediction = getRandomPredictionForFirstHalf();
                break;
            case "Повнолуние":
                prediction = getRandomPredictionForFullMoon();
                break;
            case "Спадна повнолуние":
                prediction = getRandomPredictionForAfterFullMoon();
                break;
            case "Остання чверть":
                prediction = getRandomPredictionForSecondHalf();
                break;
            default:
                prediction = "Невідоме передбачення";
        }
        return prediction;
    }

    private static String getRandomPredictionForNewMoon() {
        String[] predictions = {
                "У вас з'явиться нова можливість, яка відкриє двері до успіху.",
                "Ваші творчі здібності стануть сильнішими і ви зможете реалізувати свої ідеї.",
                "В цей період вам необхідна розсудливість і зосередженість для досягнення ваших цілей.",
                "Знайомство з цікавою особою може стати вихідним пунктом для нових стосунків.",
                "Ви зможете привернути увагу впливових людей, що сприятиме вашій кар'єрі",
                "Будьте обережні із витратами грошей, оскільки великі витрати можуть нашкодити вашому фінансовому становищу.",
                "Дотримуйтесь здорового способу життя, займайтесь фізичними вправами і правильно харчуйтеся",
                "Зміни в особистому житті можуть призвести до більшої гармонії і щастя.",
                "Розгляньте можливість вдосконалення своїх навичок інтелектуального розвитку.",
                "Подорож до нового місця може принести вам незабутні враження."



        };
        return getRandomElement(predictions);
    }
    private static String getRandomPredictionForMolodoySichyga() {
        String[] predictions = {
                "З'явиться нова хвиля інспірації та творчого потенціалу.",
                "Ваша енергія буде наростати, дозволяючи вам зосередитися на своїх цілях та завданнях.",
                "Ви зможете зробити прогрес у розвитку своїх навичок та здібностей.",
                "Це час для нових початків і здійснення своїх мрій та планів.",
                "Появиться можливість знайти нові перспективи та шляхи розвитку.",
                "Ви будете відчувати більшу впевненість у собі та своїх здібностях.",
                "Взаємини з людьми набудуть більшої гармонії та співпраці.",
                "З'явиться можливість насолодитися природою і провести більше часу на свіжому повітрі.",
                "Ваші творчі проекти та ідеї можуть отримати визнання та успіх.",
                "Появиться можливість зосередитися на своєму фізичному та емоційному благополуччі та здоров'ї."
        };
        return getRandomElement(predictions);
    }
    private static String getRandomPredictionFirstPart() {
        String[] predictions = {
                "Ви зможете впоратися зі складними завданнями і досягти значних успіхів.",
                "Ваша комунікація з оточуючими покращиться, що дозволить вам знаходити спільну мову з людьми легше.",
                "Будьте уважними до можливих фінансових можливостей, які можуть з'явитися у вашому житті.",
                "Вам слід зосередитися на власному здоров'ї і займатися профілактикою хвороб.",
                "Розширення освітніх знань або набуття нових навичок можуть виявитися важливими для вашої кар'єри.",
                "Важливе рішення, яке ви приймете в цей період, може мати велике значення для вашого майбутнього.",
                "Будьте відкриті до нових можливостей і не бійтесь виходити зі зони комфорту.",
                "Знайомство з цікавими людьми може привести до нових можливостей і співпраці.",
                "Розуміння ваших емоцій і емоцій оточуючих людей допоможе вам у спілкуванні і вирішенні конфліктів.",
                "Знайдіть час для відпочинку і релаксації, щоб підтримувати баланс в своєму житті.",


        };
        return getRandomElement(predictions);
    }

    private static String getRandomPredictionForFirstHalf() {
        String[] predictions = {
                "Ваша енергія буде зростати разом із наростаючим повнолунням, дозволяючи вам бути активними і продуктивними.",
                "Ваші почуття і емоції можуть посилитися, ви можете відчувати більшу інтенсивність і глибину своїх емоцій.",
                "Це час, коли ви можете зосередитися на досягненні своїх цілей і виконанні задуманого.",
                "З'явиться можливість розглянути і переглянути свої вірування та цінності, що допоможе вам вирішити, що дійсно важливо для вас.",
                "Ви можете знайти внутрішню міць і рішучість для подолання перешкод і викликів, які зустрічаються на вашому шляху.",
                "Збережіть гармонію у своїх взаєминах з близькими людьми і будьте уважними до їхніх потреб і почуттів.",
                "Знайдіть час для самозростання і розвитку своїх навичок, що допоможе вам стати сильнішими та мудрішими.",
                "Під час наростаючого повнолуння може з'явитися нова можливість або пропозиція, яка варто розглянути.",
                "Будьте уважними до своєї фізичної та емоційної стійкості, доглядайте за своїм здоров'ям і добробутом.",
                "Використайте цей час, щоб зосередитися на самопізнанні та розкритті свого потенціалу."
        };
        return getRandomElement(predictions);
    }

    private static String getRandomPredictionForFullMoon() {
        String[] predictions = {
                "Під час цього повнолуння ви будете почувати себе енергійними і впевненими.",
                "Ваші емоції можуть бути посилені під час повнолуння, тому дотримуйтеся розумної емоційної стійкості.",
                "Можливо, ви знайдете розуміння і прозріння щодо складних ситуацій, з якими стикалися раніше.",
                "Це хорочий час для саморефлексії та розгляду особистих цілей і планів.",
                "Ви можете отримати важливу інтуїтивну інформацію або відчути сильну інтуїцію щодо рішень та напрямку у вашому житті.",
                "Можливість досягнення емоційної гармонії та збалансованості.",
                "З'явиться можливість проявити творчість та виразити себе через мистецтво, письменство або музику.",
                "Можливість підсилення ваших стосунків з близькими людьми та партнерами.",
                "Важливі відкриття та нові можливості можуть з'явитися в вашому житті.",
                "Зверніть увагу на своє фізичне здоров'я і займайтеся спортом, щоб підтримувати свою енергію та витривалість."
        };
        return getRandomElement(predictions);
    }
    private static String getRandomPredictionForAfterFullMoon() {
        String[] predictions = {
                "Ваша енергія буде зростати разом із наростаючим повнолунням, дозволяючи вам бути активними і продуктивними.",
                "Ваші почуття і емоції можуть посилитися, ви можете відчувати більшу інтенсивність і глибину своїх емоцій.",
                "Це час, коли ви можете зосередитися на досягненні своїх цілей і виконанні задуманого.",
                "З'явиться можливість розглянути і переглянути свої вірування та цінності, що допоможе вам вирішити, що дійсно важливо для вас.",
                "Ви можете знайти внутрішню міць і рішучість для подолання перешкод і викликів, які зустрічаються на вашому шляху.",
                "Збережіть гармонію у своїх взаєминах з близькими людьми і будьте уважними до їхніх потреб і почуттів.",
                "Знайдіть час для самозростання і розвитку своїх навичок, що допоможе вам стати сильнішими та мудрішими.",
                "Під час наростаючого повнолуння може з'явитися нова можливість або пропозиція, яка варто розглянути.",
                "Будьте уважними до своєї фізичної та емоційної стійкості, доглядайте за своїм здоров'ям і добробутом.",
                "Використайте цей час, щоб зосередитися на самопізнанні та розкритті свого потенціалу."
        };
        return getRandomElement(predictions);
    }
    private static String getRandomPredictionForSecondHalf() {
        String[] predictions = {
                "Вам слід завершити незавершені справи і підготуватися до нового початку.",
                "Ви зможете знайти внутрішню міць і волю для подолання будь-яких перешкод.",
                "Розгляньте можливість розвитку нових навичок або набуття нових знань.",
                "Візьміть участь у спільнотних заходах або волонтерській діяльності, що принесе вам задоволення і задоволення.",
                "Будьте вдячні за досягнуті результати і свої досягнення, навіть якщо вони здаються невеликими.",
                "Знайдіть час для саморефлексії і роздумів над майбутніми планами.",
                "Розслабтеся і насолоджуйтесь моментом, не забувайте про самозаботу.",
                "Ви можете отримати корисні поради від людей, які мають досвід у вашій сфері діяльності.",
                "Будьте уважними до своїх емоцій і емоцій оточуючих, це допоможе вам створити гармонійне оточення.",
                "Плануйте майбутні подорожі або пригоди, що додасть вам енергії та смаку до життя."

        };
        return getRandomElement(predictions);
    }


    private static String getRandomElement(String[] array) {
        int index = (int) (Math.random() * array.length);
        return array[index];
    }
}
