package org.example;


import java.util.HashMap;
import java.util.Map;

public class ZodiacDescriptionManager {
    private static final Map<String, String> zodiacDescriptions = new HashMap<>();

    static {
        // Додайте описи знаків зодіаку до словника
        zodiacDescriptions.put("Овен", "Люди, народжені під знаком Овна, є енергійними, сміливими і активними. Вони мають сильну волю та рішучість, і завжди готові прийняти виклик.");
        zodiacDescriptions.put("Близнюки","Люди, народжені під знаком Близнуків, є спритними, допитливими та комунікабельними. Вони завжди цікавляться навколишнім світом і люблять набувати нових знань. Близнюки є дотепними та вміють знайти спільну мову з різними людьми.");
        zodiacDescriptions.put("Рак", "Люди, народжені під знаком Рака, володіють великою емоційною чутливістю та здатністю до співчуття. Вони є зв'язковими і затишними, завжди готові підтримати та захистити свою родину та близьких. Раки також відзначаються творчим потенціалом та інтуїцією.");
        zodiacDescriptions.put("Телець", "Люди, народжені під знаком Тельця, є стійкими, надійними і насолоджуються комфортом. Вони цінують безпеку та матеріальне благополуччя.");
        zodiacDescriptions.put("Лев", "Люди, народжені під знаком Лева, володіють сильною харизмою та впевненістю. Вони є лідерами, здатними приносити світло та радість в життя інших людей. Леви мають творчий талант і люблять бути в центрі уваги.");
        zodiacDescriptions.put("Діва", "Діва - знак практичності та організованості. Люди, народжені під цим знаком, володіють аналітичним мисленням та уважністю до деталей. Вони стримані та дисципліновані, завжди прагнуть до вдосконалення і мають здатність розумно розв'язувати проблеми.");
        zodiacDescriptions.put("Терези", "Люди, народжені під знаком Терез, володіють збалансованою натурою та справжнім почуттям справедливості. Вони є спокійними, миролюбними та доброзичливими, завжди готові підтримати та допомогти іншим. Терези також відзначаються своєю художньою обдарованістю.");
        zodiacDescriptions.put("Скорпіон", "Люди, народжені під знаком Скорпіона, володіють сильною внутрішньою силою та стійкістю. Вони є загадковими та енергійними, завжди готові досліджувати глибини життя. Скорпіони мають сильний інтуїтивний потенціал та здатність до перетворення.");
        zodiacDescriptions.put("Стрілець", "Люди, народжені під знаком Стрільця, є свободолюбивими, оптимістичними та любителями пригод. Вони завжди прагнуть до нових горизонтів та розширення свого світогляду. Стрільці володіють гострим розумом та здатністю до високих цілей.");
        zodiacDescriptions.put("Козеріг", "Козеріг - знак цілеспрямованості та стабільності. Люди, народжені під цим знаком, володіють великою працездатністю та здатністю до лідерства. Вони є практичними та дисциплінованими, завжди прагнуть до досягнення успіху.");
        zodiacDescriptions.put("Водолій", "Люди, народжені під знаком Водолія, володіють оригінальним мисленням та незалежністю. Вони є толерантними, справедливими та гуманними, завжди готові боротися за справедливість і свободу. Водолії мають сильну інтуїцію та здатність до інновацій.");
        zodiacDescriptions.put("Риби", "Люди, народжені під знаком Риб, є відчутними, сприйнятливими та мрійливими. Вони мають багатофакторну інтуїцію та здатність до емпатії. Риби завжди готові допомогти іншим і мають творчий потенціал.");

        // Додайте описи для інших знаків зодіаку
    }

    public static String getZodiacDescription(String sign) {
        String description = zodiacDescriptions.get(sign);
        if (description != null) {
            return description;
        } else {
            return "Вибачте, інформація про заданий знак зодіаку відсутня.";
        }
    }

}



